Tekla.Structures.DialogInternal.ShapeAttributes
Rebar attributes

Tekla.Structures.DialogInternal.ShapeAttributes.Shape
Gets or sets the shape name

Tekla.Structures.DialogInternal.ShapeAttributes.SelectedCallback
Gets or sets the shape selected callback action.

Tekla.Structures.DialogInternal.ShapeAttributes.ClosedCallback
Gets or sets the window closed callback action.